CSI API ETABS v1

# cHelper Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cHelper

    Public Interface cHelper

    Dim instance As cHelper

    public interface class cHelper

    type cHelper =  interface end

The cHelper type exposes the following members.

Methods

| Name| Description
---|---|---
| [CreateObject](e070ca06-d6bc-
bf74-d391-416766761e9a.htm)|  Starts the program at the given path.
|
CreateObjectHost|  Starts the
program at the given path on a given computer using the default TCP port.
|
CreateObjectHostPort|  Starts the
program at the given path on a given computer using the given TCP port.
|
CreateObjectProgID|  Starts the
program and returns the API object for the given program ID.
|
CreateObjectProgIDHost|  Starts
the program and returns the API object for the given program ID on a given
computer using the default TCP port.
|
CreateObjectProgIDHostPort|
Starts the program and returns the API object for the given program ID on a
given computer using the given TCP port.
|
GetOAPIVersionNumber|  Retrieves
the API version.
|
GetObject|  Attaches to the active
running instance of the program.
|
GetObjectHost|  Attaches to the
active running instance of the program on a given computer using the default
TCP port.
|
GetObjectHostPort|  Attaches to
the active running instance of the program on a given computer using the given
TCP port.
|
GetObjectProcess|  Attaches to the
running instance of the program with the given process id.
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com